Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In general, this is used to only render specific details to a single port when multiple view ports are visible in the room at the same time.
zh_cn: 通常，当多个视图端口在房间中同时可见时，这只用于将特定的细节渲染到单个端口。

source: In most cases you can simply use the os_is_paused() function to test this, but in some very specific cases (for example games on Chrome Apps) that function will not trigger, in which case you should use this function instead.
zh_cn: 在大多数情况下，您可以简单地使用os_is_paused()函数来测试这一点，但在一些非常特定的情况下(例如Chrome Apps上的游戏)，此函数将不会触发，在这种情况下，您应该使用此函数代替。

source: In physics, restitution is defined as "the return of an object or system to its original state after elastic deformation", but as the fixtures in the GameMaker are really rigid bodies and cannot be deformed, restitution is really a way of saying how "bouncy" the fixture is.
zh_cn: 在物理学中，恢复原状被定义为"物体或系统在弹性变形后回到其原始状态"，但由于GameMaker中的夹具是真正的刚体，不能变形，恢复原状实际上是固定装置有多"有弹性"的一种说法。

source: In principle you can create gears in GameMaker by using compounding instances to model gear teeth, but this is not very efficient and might be tedious to author!
zh_cn: 原则上，您可以在GameMaker中通过使用复合实例来模拟齿轮齿来创建齿轮，但这不是很有效，而且可能会让作者感到乏味！

source: In some cases you want to check and see if a variable holds a real number, and that's when you would use this function.
zh_cn: 在某些情况下，你想检查一个变量是否包含实数，这时你就可以使用此函数。

source: In some cases you want to check and see if a variable in GameMaker holds a boolean value, and that's when you would use this function.
zh_cn: 在某些情况下，你想要检查并查看GameMaker中的变量是否包含布尔值，这时你就可以使用此函数。

source: In some cases you want to check and see if a variable in GameMaker holds a string and not a real and that's when you would use this function.
zh_cn: 在某些情况下，你想要检查并查看GameMaker中的变量是否持有一个字符串而不是一个实数，这时你就会使用此函数。

source: In some cases you want to check and see if a variable in GameMaker holds any numeric value, and that's when you would use this function.
zh_cn: 在某些情况下，你想要检查并查看GameMaker中的变量是否包含任何数值，这时你就会使用此函数。

source: In some cases you want to check and see what data type a variable holds in GameMaker and that's when you would use this function.
zh_cn: 在某些情况下，你需要检查并查看变量在GameMaker中的数据类型，这时你就可以使用此函数了。

source: In the IDE, all layers have a name and a type, and to be able to edit or change them through code you must give the layer ID value.
zh_cn: 在IDE中，所有层都有一个名称和类型，为了能够通过代码编辑或更改它们，必须指定层ID值。

source: In the following image, you can see how this all works together:
zh_cn: 在下图中，您可以看到这一切是如何协同工作的:

source: In the special case where the number supplied is exactly a half-integer (1.5, 17.5, -2.5, etc), the number will be rounded to the nearest even value, for example, 2.5 would be rounded to 2, while 3.5 will be rounded to 4.
zh_cn: 在提供的数字正好是半整数(1.5、17.5、-2.5等)的特殊情况下，数字将被舍入到最接近的偶数，例如，2.5将被舍入到2，而3.5将被舍入到4。

source: In these cases you can check this using this function and disable the depth buffer for surfaces if required using the function surface_depth_disable().
zh_cn: 在这些情况下，您可以使用此函数检查这一点，并在需要时使用函数surface_depth_disable()禁用表面的深度缓冲区。

source: In these cases you can draw the sprite that has been assigned to the instance with this function, where you give the unique Instance ID and then the name of the animation to get the frame from (a string, as set within the program used to make the sprite).
zh_cn: 在这种情况下，你可以用此函数绘制被分配给实例的精灵，在这里你可以给出唯一的instance ID，然后是获取帧的动画名称(一个字符串，在用于制作精灵的程序中设置)。

source: In these cases you can draw the sprite with this function, where you give the sprite index and then the name of the animation to get the frame from (a string, as set within the program used to make the sprite).
zh_cn: 在这种情况下，你可以使用此函数绘制精灵，在这里你可以给出精灵索引，然后是获取框架的动画名称(一个字符串，用于制作精灵的程序中设置的)。

source: In these cases you can use this function to flag the fixture as been "asleep", in which case it will not be processing anything when it is first created in the room.
zh_cn: 在这些情况下，您可以使用此函数将夹具标记为"休眠"，在这种情况下，当它第一次在房间中创建时，它将不会处理任何东西。

source: In these cases you would use choose() to generate a random result.
zh_cn: 在这些情况下，您可以使用choose()来生成一个随机结果。

source: In this case if this variable is set to true then the sequence will handle the drawing order of the instance, otherwise normal instance drawing will occur.
zh_cn: 在本例中，如果该变量设置为true，则序列将处理实例的绘制顺序，否则将发生正常的实例绘制。

source: In this case the function will return "Arial" as that is the system name of the font.
zh_cn: 在本例中，函数将返回"Arial"，因为这是字体的系统名称。

source: In this case, any text or image displayed on display 2 will appear much larger, even though the actual resolution is the same.
zh_cn: 在这种情况下，在显示器2上显示的任何文本或图像都将显得大得多，即使实际分辨率是相同的。

source: In this way you can change the instances physical properties without having to destroy and re-create it.
zh_cn: 通过这种方式，您可以更改实例的物理属性，而不必销毁和重新创建它。

source: In this way you can check for how many times a single letter or a phrase is repeated in a section of stored text.
zh_cn: 通过这种方式，您可以检查单个字母或短语在一段存储的文本中重复的次数。

source: In this way you can copy (or "clone") one sprite into another index.
zh_cn: 通过这种方式，你可以将一个精灵复制到另一个索引中。

source: In this way you can create a new time line using the timeline_add() function and add different behaviours at any point, or simply modify a previously created time line resource with new behaviours.
zh_cn: 通过这种方式，您可以使用timeline_add()函数创建一个新的时间线，并在任意点添加不同的行为，或者简单地用新的行为修改先前创建的时间线资源。

source: In this way you can create particles of the same hue but different saturations, or of different hues but the same value (luminosity) etc...
zh_cn: 通过这种方式，你可以创建相同色调但不同饱和度的粒子，或者不同色调但相同亮度的粒子...

source: In this way you can generate a secure key which can be stored and used to check the integrity of the information being sent to (or received from) an external server (for example).
zh_cn: 通过这种方式，您可以生成一个安全密钥，该密钥可以被存储并用于检查发送到(或从)外部服务器(例如)的信息的完整性。

source: In this way you can pass the value to extensions for use outside of the compiled game, effectively bypassing the GameMaker drawing functions and permitting the sprite to be used in DOM content which can then be drawn anywhere within the window that contains the game canvas.
zh_cn: 通过这种方式，您可以将值传递给扩展，以便在编译后的游戏之外使用，有效地绕过GameMaker绘图函数，并允许在DOM内容中使用精灵，然后可以在包含游戏画布的窗口中的任何地方绘制精灵。

source: In this way you can procedurally change or generate layers and layer contents in a room that is not the current room.
zh_cn: 通过这种方式，您可以在不是当前房间的房间中程序性地更改或生成层和层内容。

source: In this way you can skip lines or write information on a line by line basis (see example code below).
zh_cn: 通过这种方式，您可以跳过行或逐行写入信息(参见下面的示例代码)。

source: In this way, you can have (for example) a bomb change into an explosion - in which case the "perf" argument would probably be true as you would want the bomb to perform its Destroy Event and Clean Up Event, as well as the explosion to perform its Create Event - or you could have your player character change into a different one - in which case the "perf" argument would probably be false as you do not want the instances to perform their Create and Destroy/Clean Up events.
zh_cn: 以这种方式，你可以让(例如)一个炸弹变成一个爆炸——在这种情况下,"perf"参数可能为真，因为你希望炸弹执行它的销毁事件和清理事件，以及爆炸执行它的创建事件——或者你可以让你的玩家角色变成不同的角色——在这种情况下,"perf"参数可能为假，因为你不希望实例执行它们的创建和销毁/清理事件。

source: In those cases you can switch off drawing to the application surface and all Draw event drawing will then be done directly to the screen buffer.
zh_cn: 在这种情况下，您可以将绘制切换到应用程序表面，所有绘制事件的绘制都将直接在屏幕缓冲区中完成。

source: In those cases you can use this function to switch off writing to the z-buffer and so force whatever is being drawn to be drawn over everything else.
zh_cn: 在这些情况下，你可以使用此函数来关闭z缓冲区的写入，从而强制任何被绘制的东西被绘制到其他东西上面。

source: In those cases you would use this function.
zh_cn: 在这些情况下，您可以使用此函数。

source: In-App Purchase event
zh_cn: 应用内购买事件

source: Index of the clickable icon to remove.
zh_cn: 要删除的可单击图标的索引。

source: Index of the ds_grid that is to be used to copy the grid data to.
zh_cn: 用于将网格数据复制到的ds_grid的索引。

source: Index of the font to check.
zh_cn: 要检查的字体索引。

source: Index of the font to get the size of.
zh_cn: 要获取其大小的字体的索引。

source: Index of the mp_grid that is to be destroyed
zh_cn: 要销毁的mp_grid的索引

source: Index of the mp_grid that is to be drawn
zh_cn: 要绘制的mp_grid的索引

source: Index of the mp_grid that is to be used
zh_cn: 要使用的mp_grid的索引

source: Indicate the x position of the origin in the sprite.
zh_cn: 指示精灵中原点的x位置。

source: Indicate the y position of the origin in the sprite.
zh_cn: 指示精灵中原点的y位置。

source: Indicates the tolerance in the transparency value (0=no tolerance, 255=full tolerance).
zh_cn: 表示透明度值中的公差(0=无公差，255=全公差)。

source: Indicates the x position of the origin in the sprite.
zh_cn: 指示精灵中原点的x位置。

source: Indicates the y position of the origin in the sprite.
zh_cn: 指示精灵中原点的y位置。

source: Indicates whether diagonal moves are allowed instead of just horizontal or vertical
zh_cn: 指示是否允许对角线移动，而不仅仅是水平或垂直移动

source: Indicates whether to make all pixels with the background colour (left-bottom pixel) transparent.
zh_cn: 指示是否使背景色的所有像素(左下角像素)透明。

source: Indicates whether to smooth the edges if transparent.
zh_cn: 指示透明时是否平滑边缘。

source: Indicates whether to smooth the edges.
zh_cn: 指示是否平滑边缘。

source: Inertia is the measure of how hard it is to make something start or stop moving, so the lower the value for this read-only variable and the easier it will be to set the instance in motion, while higher values will require more force to start it moving
zh_cn: 惯性是衡量使某物开始或停止运动的难度，因此该只读变量的值越低，就越容易使实例运动，而值越高，则需要更大的力来使其开始运动

source: Ini Files are split into sections and then each section is subsequently split into key - value pairs.
zh_cn: Ini文件被分成几个部分，然后每个部分又被分成键值对。

source: Instance or object to have the camera target for following
zh_cn: 实例或对象，使相机跟随目标

source: Instances destroyed in this way will trigger their Destroy and Clean Up events.
zh_cn: 以这种方式销毁的实例将触发它们的销毁和清理事件。

source: Instead you should have set the width to 150 to compensate the scaling.
zh_cn: 相反，您应该将宽度设置为150来补偿缩放。

source: Internet Explorer
zh_cn: IE浏览器(Internet Explorer)

source: Internet Explorer on a mobile device
zh_cn: 移动设备上的ie浏览器

source: Invokes a callback after the specified time.
zh_cn: 在指定的时间后调用回调。

source: It allows for a few more checks, in particular you can use keycodes vk_lshift, vk_lcontrol, vk_lalt, vk_rshift, vk_rcontrol and vk_ralt to check whether the left or right shift, control or alt key is pressed.
zh_cn: 它允许更多的检查，特别是你可以使用键盘代码vk_lshift, vk_lcontrol, vk_lalt, vk_rshift, vk_rcontrol和vk_ralt来检查是否按下了左shift或右shift，控制或alt键。

source: It allows to specify a start position (1-based) and a length.
zh_cn: 它允许指定起始位置(基于1)和长度。

source: It can also be used for describing exponential growth or decay, and is often called a binary logarithm.
zh_cn: 它也可以用来描述指数增长或衰减，通常被称为二进制对数。

source: It can also be useful for clearing surfaces when they are newly created.
zh_cn: 它还可以用于清除新创建的表面。

source: It can be used for HTML5 too, but will only return a value relative to the 0,0 of the canvas itself, and will not return any value while the mouse is outside of the canvas.
zh_cn: 它也可以用于HTML5，但是只会返回一个相对于画布本身的0,0的值，并且当鼠标在画布之外时不会返回任何值。

source: It can be useful for things like temporarily stopping a path follower if something is in the way (see the example code below).
zh_cn: 如果有什么东西挡住了去路，这对于临时停止路径跟随器是很有用的(参见下面的示例代码)。

source: It can be useful for things like working out when to limit a custom text entry's character length (eg: capping a player's name to 10 characters).
zh_cn: 它可以用于计算何时限制自定义文本条目的字符长度(例如:将玩家的名字限制在10个字符以内)。

source: It can be useful to see if an ini file has saved specific data and a few other things, however.
zh_cn: 然而，查看ini文件是否保存了特定的数据和其他一些东西是很有用的。

source: It can be useful, for example, to add a user name into a predefined text and so make the player of your game feel more involved in the action.
zh_cn: 例如，在预定义的文本中添加一个用户名会很有用，这样会让玩家感觉更投入到游戏中。

source: It does not move the tilemap - nor change it in any way - and does it matter if the tilemap is flagged as visible or not.
zh_cn: 它不会移动tilemap -也不会以任何方式改变它 -并且tile map是否被标记为可见并不重要。

source: It does not reset or remove the particle types themselves, just their visual representation, and if you have any object streaming particles from an emitter, these particles disappear but will begin to appear again the next step after calling this code.
zh_cn: 它不会重置或移除粒子类型本身，而只是它们的视觉表示，如果您有任何来自发射器的对象流粒子，这些粒子会消失，但在调用此代码后的下一步会再次出现。

source: It does not return the real number but rather true or false, so a value of, for example, "fish" would return false, however a value of 200 would return true.
zh_cn: 它不返回实数，而是返回true或false，因此，例如"fish"的值将返回false，而200的值将返回true。

source: It does not return the string but rather true or false, so a value of, for example, "fish" for n will return true, but a value of 200 for n will return false.
zh_cn: 它不返回字符串，而是返回true或false，因此，例如，n的值"fish"将返回true，但n的值200将返回false。

source: It does this in steps of size "rotstep" (default value is 10), and reducing this gives the instance more movement possibilities but will be slower as it needs more processing power.
zh_cn: 它以"rotstep"大小的步长（默认值为 10）来执行此操作，并且减少此步数会为实例提供更多移动可能性，但会因为需要更多处理能力而变慢。

source: It is a good idea to have alpha blending off whenever possible (especially when developing for mobile devices) as this greatly increases the draw speed.
zh_cn: 在可能的情况下将alpha混合是一个好主意(特别是在面向移动设备开发时)，因为这将大大提高绘制速度。

source: It is a pitch multiplier, in that the input value multiplies the current pitch by that amount, so the default value of 1 is no pitch change, while a value of less than 1 will lower the pitch and greater than 1 will raise the pitch.
zh_cn: 它是一个音高乘数，因为输入值将当前音高乘以该值，因此默认值1表示音高不变，而小于1的值将降低音高，大于1的值将提高音高。

source: It is a value that can be added on to the speed of objects so that they will eventually move at the same speed, regardless of lag.
zh_cn: 这是一个可以添加到物体速度上的值，以便它们最终以相同的速度移动，而不考虑延迟。

source: It is also commonly used to check the integrity of data.
zh_cn: 它也常用于检查数据的完整性。

source: It is also commonly used to check the integrity of files and strings.
zh_cn: 它还通常用于检查文件和字符串的完整性。

source: It is also worth noting that the first stage "slot" is always used automatically by GameMaker.
zh_cn: 还值得注意的是，GameMaker 始终自动使用第一阶段"插槽"。

source: It is based on a linear scale from 0 (silent) to any value greater than 0, although normally you'd consider the maximum volume as 1.
zh_cn: 它基于从0(静默)到任何大于0的值的线性缩放，尽管通常您会认为最大音量为1。

source: It is best to use small increments for this function as any value under 0 or over 5 may not be audible anyway.
zh_cn: 此函数最好使用小的增量，因为任何小于0或大于5的值都可能听不到。

source: It is built on two basic structures:
zh_cn: 它建立在两个基本结构上:

source: It is effectively the overall colour and brightness (or darkness) of a scene.
zh_cn: 它实际上是一个场景的整体颜色和亮度(或黑暗)。

source: It is enabled by default.
zh_cn: 默认启用。

source: It is essential that you call this whenever the MP grid is finished with or you could potentially get a memory leak, meaning that your game will slow down over time and eventually crash.
zh_cn: 重要的是，每当MP网格结束时，你都要调用此函数，否则你可能会出现内存泄漏，这意味着你的游戏会随着时间的推移而变慢，最终崩溃。

source: It is important to note that on Android, if the project does not have any shader resources defined, then the function will always return false, regardless of whether the device supports shaders or not.
zh_cn: 需要注意的是，在Android上，如果项目没有定义任何着色器资源，那么函数将总是返回false，不管设备是否支持着色器。

source: It is important to note that the function is designed to be called in the Draw GUI End Event, which should give consistent results across all platforms.
zh_cn: 需要注意的是，此函数被设计为在Draw GUI End Event中调用，它应该在所有平台上提供一致的结果。

source: It is similar to the xprevious and yprevious variables in how it works, only it is specific for paths.
zh_cn: 它的工作方式类似于xprevious和yprevious变量，只是它特定于路径。

source: It is typically used to draw an overlay, for example, to show the score or other aspects as this gives a "flat" view of the elements drawn (ie: no perspective) in a 3D game.
zh_cn: 它通常用于绘制覆盖图，例如，显示分数或其他方面，因为这提供了3D游戏中绘制的元素的"平面"视图(即:无透视)。

source: It is useful when dealing with floating point maths as it can reduce the "rounding errors" that make certain operations return values that appear incorrect or contrary to what we expect.
zh_cn: 它在处理浮点数学时很有用，因为它可以减少"舍入误差"，这些误差使某些操作返回的值看起来不正确或与我们预期的相反。

source: It is very handy for calculating distances between text elements based on the maximum width of a string that is split over several lines as it would be drawn with draw_text_ext() using the currently defined font.
zh_cn: 它非常方便地计算文本元素之间的距离，基于被分割为几行的字符串的最大宽度，就像使用当前定义的字体使用draw_text_ext()绘制它一样。

source: It is very handy for calculating distances between text elements based on the tallest of the letters that make up the string as it would be drawn with draw_text() using the currently defined font.
zh_cn: 根据组成字符串的最高字母来计算文本元素之间的距离非常方便，因为它是用draw_text()使用当前定义的字体绘制的。

source: It is very handy for calculating distances between text elements based on the tallest of the letters that make up the string as well as the actual string length itself when spread over several lines as it would be drawn with draw_text_ext() using the currently defined font.
zh_cn: 这对于计算文本元素之间的距离是非常方便的，它基于组成字符串的最高字母以及实际的字符串长度本身，当它分布在几行上时，就像使用当前定义的字体用draw_text_ext()绘制的一样。

source: It is very handy for calculating distances between text elements based on the total width of the letters that make up the string as it would be drawn with draw_text() using the currently defined font.
zh_cn: 根据组成字符串的字母的总宽度计算文本元素之间的距离非常方便，因为它将使用当前定义的字体用draw_text()绘制。

source: It is worth noting that the final size of the data being sent that is returned by this function will also include the GameMaker header information, which is an additional 12 bytes.
zh_cn: 值得注意的是，此函数返回的最终数据大小还包括GameMaker头信息，这是额外的12个字节。

source: It is worth noting that the function will also take two reserved strings to help perform debugging using external applications like Visual Studio.
zh_cn: 值得注意的是，此函数还将使用两个保留字符串来帮助使用外部应用程序(如Visual Studio)执行调试。

source: It is worth noting that the garbage collector does not need to be active for this to work.
zh_cn: 值得注意的是，垃圾收集器不需要处于活动状态就可以工作。

source: It is worth noting that you can bind built-in functions as well as user defined functions, and you can also supply undefined as the instance/struct argument meaning that the current self scope will be used for the binding.
zh_cn: 值得注意的是，可以绑定内置函数和用户定义函数，还可以提供undefined作为实例/结构参数，这意味着将使用当前的自作用域进行绑定。

source: It is worth noting that you cannot place tiles at negative positions within the tile map, so all tiles must be placed within the cell spaces 0 to width - 1, 0 to height - 1.
zh_cn: 值得注意的是，您不能将单幅图块放置在图块集中的负位置，因此所有单幅图块必须放置在0到宽度- 1、0到高度- 1的单元空间内。

source: It only returns a string with the full name and path of the file.
zh_cn: 它只返回一个带有文件全名和路径的字符串。

source: It pauses the simulation if the flag is set to true and no further physics calculations will be done until the flag is set to false again.
zh_cn: 如果标志设置为真，它将暂停模拟，并且不会进行进一步的物理计算，直到标志再次设置为假。

source: It requires the unique "id" of the bound fixture (as returned by the function physics_fixture_bind() and it will remove all the currently defined physics properties for the instance, permitting you to redefine a new fixture and bind that to the instance.
zh_cn: 它需要绑定的夹具的唯一"id"(由函数physics_fixture_bind()返回)，它将删除实例当前定义的所有物理属性，允许您重新定义一个新夹具并将其绑定到实例。

source: It returns -1 if there are no further notifications queued, or a real value otherwise representing the ID for the notification.
zh_cn: 如果没有其他排队的通知，则返回-1，否则返回一个表示通知ID的实值。

source: It returns -1 if there are no notifications queued, or a real value otherwise representing the ID for the notification.
zh_cn: 如果没有排队的通知，它将返回-1，否则将返回一个表示通知ID的实值。

source: It returns an index that should be stored in a variable for use in all the other MP grid function calls.
zh_cn: 它返回一个索引，该索引应该存储在一个变量中，供所有其他MP网格函数调用使用。

source: It returns the new format "handle" (index) which must be used in all further vertex functions that refer to this new format.
zh_cn: 它返回新的格式"handle"(index)，该格式必须在引用该新格式的所有其他顶点函数中使用。

source: It returns true if it is, otherwise it returns false.
zh_cn: 如果是则返回true，否则返回false。

source: It returns true or false depending on whether the value is a 3 value vector or not.
zh_cn: 它根据值是否为3值向量返回true或false。

source: It returns true or false depending on whether the value is a 4 value vector or not.
zh_cn: 它根据值是否为4值向量返回true或false。

source: It returns true or false depending on whether the value is a matrix or not.
zh_cn: 它根据值是否为矩阵返回true或false。

source: It returns true or false depending on whether the value is a pointer or not.
zh_cn: 它根据值是否是指针返回true或false。

source: It returns true or false depending on whether the value is an int 32 or not.
zh_cn: 它根据值是否是int类型32返回true或false。

source: It returns true or false depending on whether the value is an int64 or not.
zh_cn: 它根据值是否为int64返回true或false。

source: It returns true or false depending on whether the value is defined or not.
zh_cn: 它根据是否定义值返回true或false。

source: It returns true or false depending on which one of the two buttons the user presses.
zh_cn: 它根据用户按下的两个按钮中的哪个返回true或false。

source: It should also be noted that other factors like gravity and collisions can also affect the torque of an instance.
zh_cn: 还应该注意的是，重力和碰撞等其他因素也会影响实例的扭矩。

source: It should be larger than 1.
zh_cn: 它应该大于1。

source: It should be noted that HTTP request parameters (the bits sometimes "tacked on" to the end of a URL when you submit a form on a web page) are perfectly acceptable when using this function too.
zh_cn: 需要注意的是，在使用此函数时，HTTP请求参数(当您在网页上提交表单时，有时会"附加"到URL末尾的位)也是完全可以接受的。

source: It should be noted that forces are not applied to the center of mass of the object, but rather at a point in the room and they will change the direction and speed as well as the torque (spin) dependant on any other forces that are working on the object (like gravity).
zh_cn: 应该注意的是，力不是施加到物体的质心，而是施加到房间中的一点，并且它们将改变方向和速度以及扭矩(旋转),这取决于作用在物体上的任何其他力(如重力)。

source: It should be noted that if you call this to check the application_surface immediately after having changed its size using surface_resize() it will not return the new value as the change needs a step or two to be fully processed.
zh_cn: 需要注意的是，如果您在使用surface_resize()更改了application_surface的大小之后立即调用此函数来检查application_surface，它将不会返回新值，因为更改需要一到两步才能完全处理。

source: It should be noted that this function only works properly when used on the Windows target.
zh_cn: 应该注意的是，此函数只有在Windows目标上使用时才能正常工作。

source: It should be noted that this function will only delete those files that GameMaker is able to create and parse: ini files, text files and binary files, or those files made to store game created resources like sprites or surfaces.
zh_cn: 需要注意的是，此函数只会删除那些GameMaker能够创建和解析的文件:ini文件、文本文件和二进制文件，或者那些用来存储游戏创建的资源(如精灵或表面)的文件。

source: It should be noted that this function will work for on the HTML5 platform, retrieving the url parameters.
zh_cn: 需要注意的是，此函数将在HTML5平台上工作，检索url参数。

source: It should be noted that this will free up the stream but on the target platform this may not show up in a memory manager.
zh_cn: 应该注意的是，这将释放流，但在目标平台上，这可能不会显示在内存管理器中。

source: It should be noted that with this function, forces are not applied to the center of mass of the object, but rather at a point relative to the instance and they will not be instantly applied as they are dependent on any other forces that are working on the object (like gravity).
zh_cn: 应该注意的是，通过此函数，力不会施加到对象的质心，而是相对于实例的一个点，并且它们不会立即施加，因为它们取决于作用在对象上的任何其他力(如重力)。

source: It should be of the "grow" type, with the size being approximately that of the expected return data.
zh_cn: 它应该是"grow"类型的，大小与预期返回数据的大小大致相同。

source: It takes the group index as returned when the group was created using the function audio_create_sync_group(), and frees all resources used by the group.
zh_cn: 它接受使用函数audio_create_sync_group()创建组时返回的组索引，并释放组使用的所有资源。

source: It takes the half width and height as the physics world uses this value far more than whole width/height values to determine things like collisions.
zh_cn: 它采用半宽和半高，因为物理世界使用这个值远多于整个宽度/高度值来确定碰撞之类的事情。
